Repository: Girguis/Academic-Counseling
Catalog: API/FOS/FOS.Core/Languages/Resource.*.resx
Languages: ar

source: Bifuraction
ar: التشعيب

source: Coures Registration
ar: تسجيل المقررات

# CourseAlreadyExist
source: This Course Already Exist
ar: هذا المقرر موجود بالفعل

source: Doctor
ar: دكتور

# DoesntExist
source: {0} Does Not Exist
ar: غير موجود{0}

# EmailExist
source: Email Already Exist
ar: البريد الالكترونى موجود بالفعل

# EmptyList
source: The List Can't Be Empty
ar: القائمة المرسلة لا يجب أن تكون فارغة

# FileNotValid
source: File Is Not Valid
ar: توجد مشكلة بالملف

source: Invalid ID
ar: الكود التعريفى غير صالح

# NoMoreBifuraction
source: There's No More Bifuraction For You
ar: لا يوجد تشعيبات أخرى متاحه

# NotAvailable
source: {0} Is Not Available
ar: {0} غير متاح الأن

# Restored
source: Restored Successfully
ar: تم الأستعادة بنجاح

source: Student
ar: الطالب

source: Super Admin
ar: مسئول السيستم

# WrongUploadedSheetFile
source: Uploaded Sheet Is For {0} While Requested Course Is For {1}
ar: الملف المرفوع لمقرر {0} فى حين أنه تم الطلب لمقرر{1}

# InvalidDateinterval
source: Start Date Can't Be Greater than Or Equal To End Date
ar: تاريخ البداية لا يمكن أن يكون أكبر من تاريخ النهاية

source: ID Can't Be Empty
ar: المعرف لا يمكن أن يكون فارغًا

# CourseAddDelete
source: Course Addition And Deletion
ar: حذف وإضافه

source: Course Withdraw
ar: انسحاب

# AllWithdrawUsed
source: You Have Used All Of Your Withdraw Chances
ar: لقد استنفذت كل فرص الانسحاب

# CantWithdraw
source: You Can't Withdraw From Any Course
ar: لا يمكنك الانسحاب من اي مقرر

# NotEnoughWithdrawChances
source: You Have Only {0} Chances And You Requested For {1}
ar: لقد طلبت الانسحاب من {0} مقرر بينما الانسحاب من {1} مقررات فقط

source: Course Overload
ar: زيادة عبء

# GpaAbove3
source: Last Regular Semester's GPA Must Be >= 3.0
ar: المعدل الفصلى لأخر ترم يجب أن يكون أكبر من أو يساوى 3

# CantEnrollEnhancementCourse
source: You Can't Enroll In An Enhancement Course
ar: لا يمكنك التسجيل لمقرر تحسين

# NoEnhancementCredit
source: You Don't Have Any Enhancement Credit Left
ar: لا يوجد لديك فرص أخرى للتحسين

source: Done
ar: تم

source: Course Enhancement
ar: تحسين

# GraduationCourse
source: Course Opening For Graduation
ar: دواعى تخرج

# For4thYearOnly
source: Available For 4th Year Students Only
ar: متاح لطلبه المستوى الرابع فقط

source: Program Transfer
ar: تحويل مسار

source: Add
ar: إضافه

source: Delete
ar: حذف

source: University Requirement
ar: متطلب جامعة

source: Elective
ar: اختياري

source: Mandetory
ar: اجبارى

source: Program Admin
ar: مسئول البرنامج

source: Supervisor
ar: مرشد أكاديمي

source: Practical
ar: عملي

source: Oral
ar: شفوي

# YearWork
source: Year Work Grades
ar: أعمال فصلية

source: Male
ar: ذكر

source: Female
ar: أنثى

# NoPrerequisite
source: Doesn't Have Any Prerequisite
ar: بدون متطلبات سابقة

# OnePrerequisite
source: Has 1 Prerequisite Only
ar: متطلب واحد فقط

# AndRelationPrerequisites
source: Prerequisites With And Relation Between Them
ar: أكثر من متطلب العلاقة بينهم(و)

# OrRelationPrerequisites
source: Prerequisites With Or Relation Between Them
ar: أكثر من متطلب العلاقة بينهم(أو)

source: Fall
ar: فصل الخريف

source: Spring
ar: فصل الربيع

source: Summer
ar: فصل الصيف

# CourseDoesntHaveThisMarkType
source: The Course You Have Requested Sheet For Doesn't Have a {0} Marks
ar: هذا المقرر لا يحتوى على درجات ل {0}

# InvalidData
source: Entered Data Is Invalid
ar: البيانات التى تم ادخالها غير صحيحه

# YouCantRegister
source: You Can't Register To These Courses
ar: لا يمكنك التسجيل فى هذه المقررات
